exampleCases/example.uniform.inflow.ALM/0.original/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    lower
    {
        type            cyclic;
    }
    upper
    {
        type            cyclic;
    }
    west
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
    east
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (10 0 0);
    }
    north
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
