exampleCases/example.uniform.inflow.ALM/0.original/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lower
    {
        type            cyclic;
    }
    upper
    {
        type            cyclic;
    }
    west
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    east
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    north
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
