exampleCases/example.uniform.inflow.ALM/0.original/Rwall
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volSymmTensorField;
    location    "0";
    object      Rwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    lower
    {
        type            cyclic;
    }
    upper
    {
        type            cyclic;
    }
    west
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    east
    {
        type            zeroGradient;
    }
    north
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
